Revit 2026 API

# FamilyManagerMakeInstance Method

---

Set the family parameter as an instance parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void MakeInstance(
	FamilyParameter familyParameter
)
```
```vb
Public Sub MakeInstance (
	familyParameter As FamilyParameter
)
```
```cpp
public:
void MakeInstance(
	FamilyParameter^ familyParameter
)
```
```fsharp
member MakeInstance :
        familyParameter : FamilyParameter -> unit
```

#### Parameters

familyParameter FamilyParameter

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument-"familyParameter"-is . |
| ArgumentException | Thrown when the input argument-"familyParameter"-is an invalid parameter or a builtIn parameter. |
| InvalidOperationException | Thrown when there is Type family parameter driven by this parameter. Or trying to make a parameter of image type to instance. |

#### Reference

FamilyManager Class

Autodesk.Revit.DB Namespace